package com.javarush.test.level01.lesson06.task01;

/* Контракт
Вывести на экран текст нового контракта:
Меня зовут Амиго.

Я согласен на зарплату $800/месяц в первый год.
Я согласен на зарплату $1500/месяц во второй год.
Я согласен на зарплату $2200/месяц в третий год.
Я согласен на зарплату $2700/месяц в четвертый год.
Я согласен на зарплату $3200/месяц в пятый год.

Поцелуй мой блестящий металлический зад!
*/
public class Solution
{
    public static void main(String[] args)
    {
        String a = "Меня зовут Амиго.";
        String b = "";
        String c = "Я согласен на зарплату $800/месяц в первый год.";
        String d = "Я согласен на зарплату $1500/месяц во второй год.";
        String e = "Я согласен на зарплату $2200/месяц в третий год.";
        String f = "Я согласен на зарплату $2700/месяц в четвертый год.";
        String g = "Я согласен на зарплату $3200/месяц в пятый год.";
        String h = "";
        String i = "Поцелуй мой блестящий металлический зад!";
        System.out.println(a);
        System.out.println(b);
        System.out.println(c);
        System.out.println(d);
        System.out.println(e);
        System.out.println(f);
        System.out.println(g);
        System.out.println(h);
        System.out.print(i);
    }
}